fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияЗП</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Создаем команду формы
	ИмяКоманды = "ЗаполнитьСотрудников";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьСотрудниковНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить сотрудников";
	
	// 2. Добавляем кнопку на командную панель таблицы
	// Проверьте имя элемента командной панели в вашей форме (обычно НачисленияЗПКоманднаяПанель)
	ЭлементПанель = Элементы.НачисленияЗПКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнитьСотрудников", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияЗП
&НаКлиенте
Процедура НачисленияЗПВидРасчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Формируем список того, что МОЖНО выбирать в этом документе
	МассивРазрешенных = Новый Массив;
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом"));
	
	// Создаем фиксированный параметр отбора
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", МассивРазрешенных);
	
	// Оборачиваем в фиксированный массив, как того требует платформа
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НовыйПараметр);
	
	// Устанавливаем параметры выбора для элемента формы
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСотрудниковНаКлиенте(Команда) Экспорт
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
	
	// Очищаем таблицу перед заполнением
	Объект.НачисленияЗП.Очистить();
	
	// 1. Получаем период из шапки документа
	НачалоПериода = НачалоМесяца(Объект.ПериодРегистрации);
	КонецПериода = КонецМесяца(Объект.ПериодРегистрации);
	
	// 2. ЗАПРОС: Получаем всех сотрудников (для Оклада) 
	// и тех, кто работал по обслуживанию (для Премии)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ

		|	Пользователи.Ссылка КАК Сотрудник,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад) КАК ВидРасчета
		|ИЗ

		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления

		|	И НЕ Пользователи.Наименование ПОДОБНО ""%Не указан%""
		|	И НЕ Пользователи.Наименование ПОДОБНО ""%Сервер%""
		|	И НЕ Пользователи.Наименование = """"

		|
		|ОБЪЕДИНИТЬ ВСЕ
		|

		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеРаботы.Сотрудник,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом)

		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ВыполненныеРаботы.ЧасовКОплатеОборот > 0";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОсновнойГрафик = Справочники.ВКМ_ГрафикиРаботы.НайтиПоНаименованию("Пятидневка");
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.НачисленияЗП.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
		
		// Для окладов заполняем график, для премий он обычно не нужен
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			НоваяСтрока.ГрафикРаботы = ОсновнойГрафик;
		КонецЕсли;
		
		// Заполняем даты из периода регистрации
		НоваяСтрока.ДатаНачала = НачалоПериода;
		НоваяСтрока.ДатаОкончания = КонецПериода;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
